{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "No fault found",
    "1": "Bird strike",
    "2": "Vegetation",
    "3": "Ole equipment failure",
    "4": "Overload (class 90)",
    "5": "Faulty train unit",
    "6": "Foreign object",
    "7": "Bird nest",
    "8": "Weather",
    "9": "Suspect bird strike",
    "10": "Overload",
    "11": "Distribution",
    "12": "Historic fault closed",
    "13": "Water ingress",
    "14": "Animals incursion",
    "15": "Operational error",
    "16": "Other discipline/ third party",
    "17": "Insulator",
    "18": "Suspect vegetation",
    "19": "Suspect faulty train unit",
    "20": "Icicles",
    "21": "Miscellaneous",
    "22": "Isolation irregularity"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Animals incursion": 14,
    "Bird nest": 7,
    "Bird strike": 1,
    "Distribution": 11,
    "Faulty train unit": 5,
    "Foreign object": 6,
    "Historic fault closed": 12,
    "Icicles": 20,
    "Insulator": 17,
    "Isolation irregularity": 22,
    "Miscellaneous": 21,
    "No fault found": 0,
    "Ole equipment failure": 3,
    "Operational error": 15,
    "Other discipline/ third party": 16,
    "Overload": 10,
    "Overload (class 90)": 4,
    "Suspect bird strike": 9,
    "Suspect faulty train unit": 19,
    "Suspect vegetation": 18,
    "Vegetation": 2,
    "Water ingress": 13,
    "Weather": 8
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.53.2",
  "vocab_size": 30522
}
